Revit 2027 API
RouteAnalysisSettings.AnalysisZoneBottomOffset Property
 The bottom plane offset, in ft, of the zone used in route calculation. Default value is 8".
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AnalysisZoneBottomOffset { get; set; }
Public Property AnalysisZoneBottomOffset As Double
	Get
	Set
public:
property double AnalysisZoneBottomOffset {
	double get ();
	void set (double value);
}
member AnalysisZoneBottomOffset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for bottomOffset must be non-negative.
Remarks
 The zone's bottom plane elevation is different per plan view and is determined by adding the bottom offset to the view's level elevation.
See Also
Reference
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace